{"results": [{"artistId":425209960,"artistName":"Hands Like Houses", "bio": "Australian post-hardcore band Hands Like Houses debuted in the late 2000s, joining a crop of stylish but heavy bands that valued singalong melody as much as aggression. Following the 2012 debut Ground Dweller, which charted higher in the U.S. than their native Australia, the band began a steady rise that reached new heights with 2016's Dissonants.Formed in 2008 by members from disbanded groups Eternal Debut and So Long Safety, Hands Like Houses comprised singer Trenton Woodley, keyboardist Jamal Sebet, drummer Matt Parkitney, guitarists Alexander Pearson and Matt Cooper, and bassist Joel Tyrrell. The band released a few singles in 2011 before the arrival of its 2012 debut full-length, Ground Dweller (Rise). The album charted on the Billboard Top 200, as did its 2013 follow-up, Unimagine. In 2014, they released the remix EP Reimagine. A couple months later, Sebet parted ways with the group. In April 2015, the band began work with producer James Paul Wisner (Underøath, Paramore) on its third LP. Dissonants was released in February 2016 and shot into the Top Three of the U.S. hard rock chart, peaking in the Australian Top Ten. An international tour followed, which kept the band on the road with acts A Day to Remember, the Amity Affliction, Northlane, and Motionless in White. In 2017, the band signed a deal with Hopeless Records. Their first album for the label, the pop-leaning Anon. arrived in 2018 and featured the singles 'Overthinking' and 'Monster.'", "photo": "https://is3-ssl.mzstatic.com/image/thumb/Features124/v4/4c/86/2c/4c862c48-b5a3-c0b9-28ef-af7d4d52173b/pr_source.png/380x380cc-60.jpg", "founded": 2008, "hometown": "Canberra, Australia", "members": "Trenton Woodley (Vocals and Keys), Matt Cooper (Lead Guitar), Alex Pearson (Rhythm Guitar and Backing Vocals), Joel Tyrrell (Bass Guitar and Backing Vocals), Matt Parkitny (Drums)"},{"artistId":390853789,"artistName":"In Hearts Wake", "bio": "With a driving and melodic sound, In Hearts Wake are an ARIA-charting metalcore band based out of Byron Bay, Australia. Formed in 2006 by singer Jake Taylor, guitarists Ben Nairne and Eaven Dall, bassist Kyle Erich, and drummer Caleb Burton, the band debuted its sound, which merges atmospheric synths with melodic hardcore, in 2007 with the EP Into the Storm. The band followed up quickly with another EP, delivering The Getaway in 2008. In 2012 In Hearts Wake signed on with UNFD, which released their debut full-length, Divination, later that year. After a heavy bout of touring, the band returned to the studio to begin laying down tracks for their next full-length, Earthwalker, which arrived in 2014. Skydancer was released the following year, with Equinox (a split EP with Northlane) dropping in 2016, prior to drummer Conor Ward joining the band's lineup as a replacement for Caleb Burton late that year. In April 2017, the band issued the single 'Warcry' in anticipation of the release of their fourth studio long-player, Ark, which arrived later that May.", "photo": "http://thedwarf.com.au/img/resized/in-hearts-wake-announce-australian-tour.jpg", "founded": 2006, "hometown": "Byron Bay, Australia", "members": "Jake Taylor (Vocals), Eaven Dall (Lead Guitar and Backing Vocals), Ben Nairne (Rhythm Guitar), Kyle Erich (Bass and Vocals), Conor Ward (Drums)"},{"artistId":421186855,"artistName":"Make Them Suffer", "bio": "A dynamic Aussie extreme metal outfit, Make Them Suffer employ a punishing blend of deathcore and blackened symphonic death metal, as heard on their 2020 full-length How to Survive a Funeral. Formed in Perth in 2008 by Sean Harmanis (vocals), Nick McLernon (guitar), Richard West (guitar), Chris Arias-Real (bass), Heather Menaglio (keys), and Tim Madden (drums), the group dropped its debut EP, Lord of Woe, in 2010. A line-up change in 2011 saw Menaglio replaced by Louisa Burton, with the group issuing its first full-length, Neverbloom, two years later via Roadrunner Records. The group's sophomore outing, 2015s Old Souls, caught the attention of Rise Records, which reissued the album in 2016. That year also saw the release of the singles 'Ether' and 'Fireworks' in anticipation of the arrival of Make Them Suffer's third studio long-player (and official Rise debut), Worlds Apart, which dropped in 2017. That same year, the band went through more line-up changes, with Burton, Madden, and guitarist Lachlan Monty -- who had joined in 2013 -- parting ways. Harmanis and McLernon drafted in Jordan Mather (drums), Jaya Jeffery (bass), and Booka Nile (keys), with the refreshed band heading out on a world tour in 2018 in support of Worlds Apart. Toward the end of 2019, the band started work on their fourth album, with Drew Fulk (Motionless in White, Lil Wayne) in the producer's chair. Preceded by the singles 'Erase Me' and 'Soul Decay,' the album, How to Survive a Funeral, was issued by Rise in mid-2020", "photo": "https://is1-ssl.mzstatic.com/image/thumb/Features114/v4/01/19/94/01199420-ed84-69db-37cd-57239f1e3b53/pr_source.png/380x380cc-60.jpg", "founded": 2008, "hometown": "Perth, Australia", "members": "Sean Harmanis (Vocals), Nick McLernon (Guitar and Backing Vocals), Jordan Mather (Drums), Jaya Jeffery (Bass), Booka Nile (Keys and Vocals)"},{"artistId":449513466,"artistName":"The Amity Affliction", "bio": "Of all the metalcore groups to blow up in the 2010s, The Amity Affliction may be the most introspective. The genre boasts no shortage of bands dealing with all the gnarly emotions roiling inside of them. But whereas most of their peers approach the genre as a form of catharsis, The Amity Affliction, formed in the city of Gympie in Australia, instead use it as a mode of self-examination. This trademark quality emerged big-time on 2012’s Chasing Ghosts and its 2014 follow-up Let the Ocean Take Me, a pair of breakout albums that, in addition to pushing the group to the top of the Australian charts, built a fanbase outside their native country. On both records, lead singer Joel Birch (who has been vocal about his struggles with mental illness) isn’t concerned with exorcising his demons so much as bravely sitting with them. The result are soul-searching reflections on depression and suicide, loss, and grief. It helps that The Amity Affliction know how to write songs that are as catchy as they are heavy, a skill they’ve honed ever since forming in 2003, when they were still in high school. The 2019 hit ballad “Drag the Lake” deftly balances clean emo vocals and shimmering piano with gut-twisting screams and mountainous guitars. Just as excellent is 2020’s super-intense “Soak Me in Bleach,” a song whose massive sing-along chorus and thrilling shifts between high-decibel torment and melancholic synth textures notched The Amity Affliction a mainstream-rock hit in the United States. None of their hooks are confections: When they employ loud-soft dynamics or expertly blend together tender pop melodies with riff-fueled aggression, it’s to further heighten the expressiveness of their music. For The Amity Affliction, it’s always about the emotion.", "photo": "https://is1-ssl.mzstatic.com/image/thumb/Features124/v4/68/3e/97/683e978a-7cd3-4da5-6d12-aacfcf1339bf/pr_source.png/380x380cc-60.jpg", "founded": 2002, "hometown":"Brisbane, Australia", "members": "Ahren Stringer (Bass and Vocals), Joel Birch (Vocals), Dan Brown (Guitar and Backing Vocals), Joe Longobardi (Drums)"}]}